Дошкольное_учреждение83/src/Documents/удуТабельУчетаПосещаемостиДетей/удуТабельУчетаПосещаемостиДетей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>удуТабельУчетаПосещаемостиДетей</name>
  <registerRecords>InformationRegister.удуСведенияОПосещаемостиДОУ</registerRecords>
  <attributes>
    <name>Учреждение</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаДетскогоУчреждения</name>
    <type>
      <types>CatalogRef.удуГруппыУчреждения</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДнейВМесяце</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРабочихДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>EnumRef.удуРежимРаботыДОУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Воспитатель</name>
    <type>
      <types>CatalogRef.удуСотрудникиОрганизаций</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Невыходы</name>
    <attributes>
      <name>Ребенок</name>
      <type>
        <types>CatalogRef.удуДети</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНевыхода</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричиныНепосещения</name>
      <type>
        <types>CatalogRef.удуПричиныПропускаЗанятий</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дошкольное_учреждение83/src/InformationRegisters/удуСведенияОПосещаемостиДОУ/удуСведенияОПосещаемостиДОУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>удуСведенияОПосещаемостиДОУ</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПризнакПрисутствия</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаПропускаЗанятия</name>
    <type>
      <types>CatalogRef.удуПричиныПропускаЗанятий</types>
    </type>
  </resources>
  <attributes>
    <name>Воспитатель</name>
    <type>
      <types>CatalogRef.удуСотрудникиОрганизаций</types>
    </type>
  </attributes>
  <dimensions>
    <name>Учреждение</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Группа</name>
    <type>
      <types>CatalogRef.удуГруппыУчреждения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ребенок</name>
    <type>
      <types>CatalogRef.удуДети</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Дошкольное_учреждение83/src/InformationRegisters/удуГрафикиРаботыПоВидамВремени/удуГрафикиРаботыПоВидамВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>удуГрафикиРаботыПоВидамВремени</name>
  <resources>
    <name>ОсновноеЗначение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДополнительноеЗначение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроизводственныйКалендарьПятидневка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроизводственныйКалендарьПятидневкаЧасы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроизводственныйКалендарьШестидневка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроизводственныйКалендарьКалендарныеДни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОсновноеЗначениеНорма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДополнительноеЗначениеНорма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОсновноеЗначениеПолное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДополнительноеЗначениеПолное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОсновноеЗначениеНормаПолное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДополнительноеЗначениеНормаПолное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DocumentRef.удуТабельУчетаРабочегоВремениОрганизации</types>
    </type>
  </attributes>
  <dimensions>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.удуСотрудникиОрганизаций</types>
      <types>CatalogRef.удуГрафикиРаботы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Месяц</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>План</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидУчетаВремени</name>
    <type>
      <types>EnumRef.удуВидыУчетаВремени</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Дошкольное_учреждение83/src/InformationRegisters/удуСведенияОЗачисленииРебенкаВГруппу/удуСведенияОЗачисленииРебенкаВГруппу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>удуСведенияОЗачисленииРебенкаВГруппу</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОснованиеЗачисления</name>
    <type>
      <types>DocumentRef.удуДоговорОЗачисленииРебенка</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеУчетаВГруппе</name>
    <type>
      <types>EnumRef.удуСостояниеРебенкаНаУчетеВГруппе</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаВыбытияИзГруппы</name>
    <type>
      <types>CatalogRef.удуПричиныВыбытияИзГруппы</types>
    </type>
  </resources>
  <dimensions>
    <name>Учреждение</name>
    <type>
      <types>CatalogRef.удуУчреждения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ребенок</name>
    <type>
      <types>CatalogRef.удуДети</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Группа</name>
    <type>
      <types>CatalogRef.удуГруппыУчреждения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Дошкольное_учреждение83/src/Enums/удуВидыУчетаВремени/удуВидыУчетаВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>удуВидыУчетаВремени</name>
  <enumValues>
    <name>ПоДням</name>
  </enumValues>
  <enumValues>
    <name>ПоЧасам</name>
  </enumValues>
  <enumValues>
    <name>ПоВечернимЧасам</name>
  </enumValues>
  <enumValues>
    <name>ПоНочнымЧасам</name>
  </enumValues>
</mdclass:Enum>

Дошкольное_учреждение83/src/Enums/удуСостояниеРебенкаНаУчетеВГруппе/удуСостояниеРебенкаНаУчетеВГруппе.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>удуСостояниеРебенкаНаУчетеВГруппе</name>
  <enumValues>
    <name>ПринятВГруппу</name>
  </enumValues>
  <enumValues>
    <name>ИсключенИзГруппы</name>
  </enumValues>
</mdclass:Enum>

Дошкольное_учреждение83/src/Documents/удуТабельУчетаПосещаемостиДетей/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ 

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
	// Проверка наличия существующих записей в регистре
	Движения.удуСведенияОПосещаемостиДОУ.Очистить();
	Движения.удуСведенияОПосещаемостиДОУ.Записать();
	Запрос =  Новый Запрос("ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК КоличествоЗаписей
	|ИЗ
	|	РегистрСведений.удуСведенияОПосещаемостиДОУ КАК удуСведенияОПосещаемостиДОУ
	|ГДЕ
	|	удуСведенияОПосещаемостиДОУ.Период МЕЖДУ &ПериодРегистрации И КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ)
	|	И удуСведенияОПосещаемостиДОУ.Учреждение = &Учреждение
	|	И удуСведенияОПосещаемостиДОУ.Группа = &Группа");
	Запрос.УстановитьПараметр("ПериодРегистрации",ПериодРегистрации);
	Запрос.УстановитьПараметр("Учреждение",Учреждение);
	Запрос.УстановитьПараметр("Группа",ГруппаДетскогоУчреждения);
	Результат = Запрос.Выполнить().Выбрать();
	Результат.Следующий();
	
	Если Результат.КоличествоЗаписей <> 0 Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "За период " + Формат(ПериодРегистрации, "ДФ='ММММ гггг'") + " для выбранной группы уже введены сведения о посещении.
		| Сначала необходимо удалить все документы """"Табель посещаемости"""" в данном периоде, по выбранной группе.";
		Сообщение.Сообщить();
	КонецЕсли;	
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Календарь.Дата,
	|	Календарь.ОсновноеЗначение
	|ПОМЕСТИТЬ ВТ_РабочиеДни
	|ИЗ
	|	РегистрСведений.удуГрафикиРаботыПоВидамВремени КАК Календарь
	|ГДЕ
	|	Календарь.Дата МЕЖДУ &ПериодРегистрации И КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ)
	|	И Календарь.ГрафикРаботы = &График
	|	И Календарь.Месяц = &ПериодРегистрации
	|	И Календарь.План
	|	И Календарь.ВидУчетаВремени = ЗНАЧЕНИЕ(Перечисление.удуВидыУчетаВремени.ПоДням)
	|	И Календарь.ОсновноеЗначение > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	удуТабельУчетаПосещаемостиДетейНевыходы.Ребенок,
	|	удуТабельУчетаПосещаемостиДетейНевыходы.ДатаНевыхода КАК ДатаНевыхода,
	|	удуТабельУчетаПосещаемостиДетейНевыходы.ПричиныНепосещения
	|ПОМЕСТИТЬ ВТ_ДниНевыхода
	|ИЗ
	|	Документ.удуТабельУчетаПосещаемостиДетей.Невыходы КАК удуТабельУчетаПосещаемостиДетейНевыходы
	|ГДЕ
	|	удуТабельУчетаПосещаемостиДетейНевыходы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоставГруппОбученияСрезПоследних.Ребенок КАК Ребенок,
	|	НАЧАЛОПЕРИОДА(&ПериодРегистрации, МЕСЯЦ) КАК Период,
	|	ИСТИНА КАК Актуальность
	|ПОМЕСТИТЬ ВТ_ПериодыИзмененийСостава
	|ИЗ
	|	РегистрСведений.удуСведенияОЗачисленииРебенкаВГруппу.СрезПоследних(НАЧАЛОПЕРИОДА(&ПериодРегистрации, МЕСЯЦ), Группа = &Группа) КАК СоставГруппОбученияСрезПоследних
	|ГДЕ
	|	СоставГруппОбученияСрезПоследних.СостояниеУчетаВГруппе = ЗНАЧЕНИЕ(Перечисление.удуСостояниеРебенкаНаУчетеВГруппе.ПринятВГруппу)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СоставГруппОбучения.Ребенок,
	|	СоставГруппОбучения.Период,
	|	ВЫБОР
	|		КОГДА СоставГруппОбучения.СостояниеУчетаВГруппе = ЗНАЧЕНИЕ(Перечисление.удуСостояниеРебенкаНаУчетеВГруппе.ПринятВГруппу)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|ИЗ
	|	РегистрСведений.удуСведенияОЗачисленииРебенкаВГруппу КАК СоставГруппОбучения
	|ГДЕ
	|	СоставГруппОбучения.Период МЕЖДУ НАЧАЛОПЕРИОДА(&ПериодРегистрации, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ)
	|	И СоставГруппОбучения.Группа = &Группа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВлЗап.НачалоПериода,
	|	КОНЕЦПЕРИОДА(ВлЗап.КонецПериода, ДЕНЬ) КАК КонецПериода,
	|	ВТ_ПериодыИзмененийСостава.Ребенок
	|ПОМЕСТИТЬ ВТ_Дети
	|ИЗ
	|	ВТ_ПериодыИзмененийСостава КАК ВТ_ПериодыИзмененийСостава
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВТ_ПериодыИзмененийСостава.Период КАК НачалоПериода,
	|			МИНИМУМ(ЕСТЬNULL(ДОБАВИТЬКДАТЕ(ВТ_ПериодыИзмененийСостава1.Период, ДЕНЬ, -1), НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ), ДЕНЬ))) КАК КонецПериода,
	|			ВТ_ПериодыИзмененийСостава.Ребенок КАК Ребенок
	|		ИЗ
	|			ВТ_ПериодыИзмененийСостава КАК ВТ_ПериодыИзмененийСостава
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПериодыИзмененийСостава КАК ВТ_ПериодыИзмененийСостава1
	|				ПО ВТ_ПериодыИзмененийСостава.Период < ВТ_ПериодыИзмененийСостава1.Период
	|					И ВТ_ПериодыИзмененийСостава.Ребенок = ВТ_ПериодыИзмененийСостава1.Ребенок
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВТ_ПериодыИзмененийСостава.Период,
	|			ВТ_ПериодыИзмененийСостава.Ребенок) КАК ВлЗап
	|		ПО ВТ_ПериодыИзмененийСостава.Период = ВлЗап.НачалоПериода
	|			И ВТ_ПериодыИзмененийСостава.Ребенок = ВлЗап.Ребенок
	|ГДЕ
	|	ВТ_ПериодыИзмененийСостава.Актуальность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&Учреждение,
	|	&Воспитатель,
	|	&Группа,
	|	ВложенныйЗапрос.Дата КАК Период,
	|	ВложенныйЗапрос.Ребенок,
	|	ЕСТЬNULL(ВТ_ДниНевыхода.ПричиныНепосещения, ЗНАЧЕНИЕ(Справочник.удуПричиныПропускаЗанятий.ПустаяСсылка)) КАК ПричинаПропускаЗанятия,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_ДниНевыхода.ПричиныНепосещения, ЗНАЧЕНИЕ(Справочник.удуПричиныПропускаЗанятий.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.удуПричиныПропускаЗанятий.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПризнакПрисутствия
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_РабочиеДни.Дата КАК Дата,
	|		ВТ_Дети.Ребенок КАК Ребенок
	|	ИЗ
	|		ВТ_РабочиеДни КАК ВТ_РабочиеДни
	|			ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Дети КАК ВТ_Дети
	|			ПО (ВТ_РабочиеДни.Дата МЕЖДУ ВТ_Дети.НачалоПериода И ВТ_Дети.КонецПериода)) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДниНевыхода КАК ВТ_ДниНевыхода
	|		ПО ВложенныйЗапрос.Дата = ВТ_ДниНевыхода.ДатаНевыхода
	|			И ВложенныйЗапрос.Ребенок = ВТ_ДниНевыхода.Ребенок";
	
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
	Запрос.УстановитьПараметр("Воспитатель", Воспитатель);	
	Запрос.УстановитьПараметр("График",ГруппаДетскогоУчреждения.ГрафикРаботы);
	Запрос.УстановитьПараметр("Группа",ГруппаДетскогоУчреждения);
	Запрос.УстановитьПараметр("Учреждение",Учреждение);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Движения.удуСведенияОПосещаемостиДОУ.Записывать = Истина;
	Движения.удуСведенияОПосещаемостиДОУ.Загрузить(РезультатЗапроса.Выгрузить());
	
	
КонецПроцедуры
